<a href="https://colab.research.google.com/github/Santanukolkata/Data_Science/blob/master/Pandas/Panda_unstacking_stacking_01.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
import numpy as np

In [2]:
dict={'Name':['U001','U002','U003','U004','U005','U006','U007'],
      'Department':['D001','D001','D001','D002','D002','D003','D003'],
      'Salary':[10000,11000,9000,7000,5000,8000,8000],
      'Joining Date':['2000-01-01','2000-12-01','2003-01-01','2010-01-01','2015-01-01','2013-01-01','2014-01-01']}

In [3]:
df=pd.DataFrame(dict)

In [4]:
df

   Name Department  Salary Joining Date
0  U001       D001   10000   2000-01-01
1  U002       D001   11000   2000-12-01
2  U003       D001    9000   2003-01-01
3  U004       D002    7000   2010-01-01
4  U005       D002    5000   2015-01-01
5  U006       D003    8000   2013-01-01
6  U007       D003    8000   2014-01-01

In [5]:
df_unst=df.unstack(level=0)
df_unst

Name          0          U001
              1          U002
              2          U003
              3          U004
              4          U005
              5          U006
              6          U007
Department    0          D001
              1          D001
              2          D001
              3          D002
              4          D002
              5          D003
              6          D003
Salary        0         10000
              1         11000
              2          9000
              3          7000
              4          5000
              5          8000
              6          8000
Joining Date  0    2000-01-01
              1    2000-12-01
              2    2003-01-01
              3    2010-01-01
              4    2015-01-01
              5    2013-01-01
              6    2014-01-01
dtype: object

In [6]:
def cohort_period(df):
    df.sort_values(by=['Salary'],inplace=True)
    df['Salary_Rank'] = np.arange(len(df)) + 1
    return df
df = df.groupby('Department').apply(cohort_period)
df.drop(['Department'], axis=1,inplace=True)
df

              Name  Salary Joining Date  Salary_Rank
Department
D001       2  U003    9000   2003-01-01            1
           0  U001   10000   2000-01-01            2
           1  U002   11000   2000-12-01            3
D002       4  U005    5000   2015-01-01            1
           3  U004    7000   2010-01-01            2
D003       5  U006    8000   2013-01-01            1
           6  U007    8000   2014-01-01            2

In [7]:
df_unst=df.unstack(level=0)
df_unst

            Name               Salary  ... Joining Date Salary_Rank
Department  D001  D002  D003     D001  ...         D003        D001 D002 D003
0           U001   NaN   NaN  10000.0  ...          NaN         2.0  NaN  NaN
1           U002   NaN   NaN  11000.0  ...          NaN         3.0  NaN  NaN
2           U003   NaN   NaN   9000.0  ...          NaN         1.0  NaN  NaN
3            NaN  U004   NaN      NaN  ...          NaN         NaN  2.0  NaN
4            NaN  U005   NaN      NaN  ...          NaN         NaN  1.0  NaN
5            NaN   NaN  U006      NaN  ...   2013-01-01         NaN  NaN  1.0
6            NaN   NaN  U007      NaN  ...   2014-01-01         NaN  NaN  2.0

[7 rows x 12 columns]

In [8]:
df.stack(level=0)

Department
D001        2  Name                  U003
               Salary                9000
               Joining Date    2003-01-01
               Salary_Rank              1
            0  Name                  U001
               Salary               10000
               Joining Date    2000-01-01
               Salary_Rank              2
            1  Name                  U002
               Salary               11000
               Joining Date    2000-12-01
               Salary_Rank              3
D002        4  Name                  U005
               Salary                5000
               Joining Date    2015-01-01
               Salary_Rank              1
            3  Name                  U004
               Salary                7000
               Joining Date    2010-01-01
               Salary_Rank              2
D003        5  Name                  U006
               Salary                8000
               Joining Date    2013-01-01
               Salary_Rank              1
            6  Name                  U007
               Salary                8000
               Joining Date    2014-01-01
               Salary_Rank              2
dtype: object